In [116]:
import pandas as pd
from sklearn import tree
from sklearn.model_selection import train_test_split

In [117]:
# some information:
# pclass: A proxy for socio-economic status (SES)
# 1st = Upper
# 2nd = Middle
# 3rd = Lower

# age: Age is fractional if less than 1. If the age is estimated, is it in the form of xx.5

# sibsp: The dataset defines family relations in this way...
# Sibling = brother, sister, stepbrother, stepsister
# Spouse = husband, wife (mistresses and fiancés were ignored)

# parch: The dataset defines family relations in this way...
# Parent = mother, father
# Child = daughter, son, stepdaughter, stepson
# Some children travelled only with a nanny, therefore parch=0 for them.

In [118]:
df = pd.read_csv('train.csv')
df2 = df
df2

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [119]:
# check NaN
df2.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [120]:
# delete ticket and cabin and embarked
df2.drop(columns=['Ticket','Cabin','Embarked','Name'],inplace=True)

In [121]:
# change Sec into index
# male = 0 and female = 1
df2.replace('male',0,inplace=True)
df2.replace('female',1,inplace=True)

In [122]:
# add median to NaN in column   28
df2['Age'].fillna(df2['Age'].median(),inplace=True)

In [123]:
# add median to NaN in column Fare  
df2['Fare'].fillna(df2['Fare'].median(),inplace=True)

In [124]:
# concat SibSp and Parch into one column Family
df2['family'] = df2['SibSp']+df2['Parch']
df2.drop(columns=['SibSp','Parch'],inplace=True)

In [125]:
df3 = df2.drop(columns=['Survived'])

In [126]:
# divide into train and test dataset
Xtrain,Xtest,Ytrain,Ytest = train_test_split(df3,df2['Survived'])

In [127]:
# A very simple decision Tree prediction
clf = tree.DecisionTreeClassifier(criterion="entropy")
clf = clf.fit(Xtrain,Ytrain)
score = clf.score(Xtest,Ytest)
score

0.7488789237668162